BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny841.PIC
        <edc:SFRDef edc:_addr="0x58" edc:access="-----nnn" edc:cname="TIFR0" edc:impl="0x7" edc:nzwidth="0x8" ltx:memberofperipheral="TC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="TOV0" edc:desc="Timer/Counter0 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF0A" edc:desc="Timer/Counter0 Output Compare Flag A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF0B" edc:desc="Timer/Counter0 Output Compare Flag B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x59" edc:access="-----nnn" edc:cname="TIMSK0" edc:impl="0x7" edc:nzwidth="0x8" ltx:memberofperipheral="TC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="TOIE0" edc:desc="Timer/Counter0 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE0A" edc:desc="Timer/Counter0 Output Compare Match A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE0B" edc:desc="Timer/Counter0 Output Compare Match B Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5A" edc:access="-nnn----" edc:cname="GIFR" edc:impl="0x70" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXINT">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PCIF" edc:desc="Pin Change Interrupt Flags" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="INTF0" edc:desc="External Interrupt Flag 0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5B" edc:access="-nnn----" edc:cname="GIMSK" edc:impl="0x70" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXINT">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:desc="Pin Change Interrupt Enables" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="INT0" edc:desc="External Interrupt Request 0 Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5C" edc:access="nnnnnnnn" edc:cname="OCR0B" edc:nzwidth="0x8" ltx:memberofperipheral="TC0"/>
        <edc:SFRDef edc:_addr="0x5D" edc:access="nnnnnnnnnnnnnnnn" edc:cname="SP" edc:nzwidth="0x10" ltx:memberofperipheral="CPU"/>
        <edc:SFRDef edc:_addr="0x5F" edc:access="nnnnnnnn" edc:cname="SREG" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPU">
              <edc:SFRFieldDef edc:cname="C" edc:desc="Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="Zero Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="Negative Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="V" edc:desc="Two's Complement Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Sign Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="H" edc:desc="Half Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T" edc:desc="Bit Copy Storage" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I" edc:desc="Global Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x60" edc:access="nnnnnnnn" edc:cname="DIDR0" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
              <edc:SFRFieldDef edc:cname="ADC0D" edc:desc="ADC0/AREF Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC1D" edc:desc="ADC1/AIN00 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC2D" edc:desc="ADC2/AIN01 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC3D" edc:desc="ADC3/AIN10 Digital Input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC4D" edc:desc="ADC4/AIN11 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC5D" edc:desc="ADC5 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC6D" edc:desc="ADC6 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC7D" edc:desc="ADC7 Digital input Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x61" edc:access="----nnnn" edc:cname="DIDR1" edc:impl="0xF" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
              <edc:SFRFieldDef edc:cname="ADC11D" edc:desc="ADC11 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC10D" edc:desc="ADC10 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC8D" edc:desc="ADC8 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC9D" edc:desc="ADC9 Digital Input Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x62" edc:access="nnnnnnnn" edc:cname="PUEB" edc:nzwidth="0x8" ltx:memberofperipheral="PORTB"/>
        <edc:SFRDef edc:_addr="0x63" edc:access="nnnnnnnn" edc:cname="PUEA" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x64" edc:access="------nn" edc:cname="PORTCR" edc:impl="0x3" edc:nzwidth="0x8" ltx:memberofperipheral="PORTB PORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTB">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="BBMB" edc:desc="Break-Before-Make Mode Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="PORTA">
              <edc:SFRFieldDef edc:cname="BBMA" edc:desc="Break-Before-Make Mode Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x65" edc:access="------nn" edc:cname="REMAP" edc:impl="0x3" edc:nzwidth="0x8" ltx:memberofperipheral="USART0 SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
              <edc:SFRFieldDef edc:cname="U0MAP" edc:desc="USART0 Pin Mapping" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="SPI">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIMAP" edc:desc="SPI Pin Mapping" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x66" edc:access="nnnnnnnn" edc:cname="TOCPMCOE" edc:nzwidth="0x8" ltx:memberofperipheral="TOCPM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TOCPM">
              <edc:SFRFieldDef edc:cname="TOCC0OE" edc:desc="Timer Output Compare Channel 0 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC1OE" edc:desc="Timer Output Compare Channel 1 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC2OE" edc:desc="Timer Output Compare Channel 2 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC3OE" edc:desc="Timer Output Compare Channel 3 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC4OE" edc:desc="Timer Output Compare Channel 4 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC5OE" edc:desc="Timer Output Compare Channel 5 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC6OE" edc:desc="Timer Output Compare Channel 6 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC7OE" edc:desc="Timer Output Compare Channel 7 Output Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x67" edc:access="nnnnnnnn" edc:cname="TOCPMSA0" edc:nzwidth="0x8" ltx:memberofperipheral="TOCPM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TOCPM">
              <edc:SFRFieldDef edc:cname="TOCC0S" edc:desc="Timer Output Compare Channel 0 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC1S" edc:desc="Timer Output Compare Channel 1 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC2S" edc:desc="Timer Output Compare Channel 2 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC3S" edc:desc="Timer Output Compare Channel 3 Selection Bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x68" edc:access="nnnnnnnn" edc:cname="TOCPMSA1" edc:nzwidth="0x8" ltx:memberofperipheral="TOCPM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TOCPM">
              <edc:SFRFieldDef edc:cname="TOCC4S" edc:desc="Timer Output Compare Channel 4 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC5S" edc:desc="Timer Output Compare Channel 5 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC6S" edc:desc="Timer Output Compare Channel 6 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC7S" edc:desc="Timer Output Compare Channel 7 Selection Bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x69" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x6A" edc:access="------nn" edc:cname="PHDE" edc:impl="0x3" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTA">
              <edc:SFRFieldDef edc:cname="PHDEA" edc:desc="PortA High Drive Enable" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
