BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny841.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="ADC1" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="AIN00" edc:ppsfunction="ACIN0"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT1" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC01" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC02" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="ADC2" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="AIN01" edc:ppsfunction="ACIN0"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT2" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC1" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC12" edc:ppsfunction="OC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="ADC3" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="ACIN1"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT3" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="T0" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="T01" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="T02" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC2" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC21" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="ADC4" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="ACIN1"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT4" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="TWI"/>
      <edc:VirtualPin edc:name="T1" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="T10" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="T12" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC31" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC32" edc:ppsfunction="OC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="ACO0" edc:ppsfunction="ACOUT"/>
      <edc:VirtualPin edc:name="ADC5" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT5" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="T2" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="T20" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="T21" edc:ppsfunction="CS"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC41" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC42" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="ACO1" edc:ppsfunction="ACOUT"/>
      <edc:VirtualPin edc:name="ADC6" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT6" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="TWI"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC51" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC52" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="ADC7" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="ICP1" edc:ppsfunction="ICP"/>
      <edc:VirtualPin edc:name="P7" edc:ppsfunction="PORTA"/>
      <edc:VirtualPin edc:name="PCINT7" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC61" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC62" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="ADC8" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="ICP2" edc:ppsfunction="ICP"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="PORTB"/>
      <edc:VirtualPin edc:name="PCINT10" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART_ALT"/>
      <edc:VirtualPin edc:name="TOCC0" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC71" edc:ppsfunction="OC"/>
      <edc:VirtualPin edc:name="TOCC72" edc:ppsfunction="OC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="ADC9" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="PORTB"/>
      <edc:VirtualPin edc:name="PCINT11" edc:ppsfunction="EXTINT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="ADC11" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="INT0" edc:ppsfunction="EXTINT"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="PORTB"/>
      <edc:VirtualPin edc:name="PCINT9" edc:ppsfunction="EXTINT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="ADC10" edc:ppsfunction="ADC"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="PORTB"/>
      <edc:VirtualPin edc:name="PCINT8" edc:ppsfunction="EXTINT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCC"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>